client/app/controllers/session_controller.rb

SELECT `users`.* FROM `users` WHERE `users`.`username` = 'abdul' LIMIT 1
---
  def create
    user = User.find_by(username: params[:session][:username].downcase)