client/app/controllers/users_controller.rb

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`username`, `password_digest`, `phone_number`, `created_at`, `updated_at`) VALUES ('abdul', '$2a$12$13sCkbuhvt49xWSWv6CZQ.joSzp9cXA10v0SQCBrrACZddnzmRKZy', '123', '2021-08-01 20:07:50.910045', '2021-08-01 20:07:50.910045')