client/app/controllers/users_controller.rb

  def update
    if params.has_key?(:edit_user)
      @user = current_user
      params.permit!
      if @user.update_attribute(:phone_number, params[:edit_user][:phone_number]) && @user.update_attribute(:username, params[:edit_user][:username])
---
UPDATE `users` SET `users`.`username` = 'abduls', `users`.`phone_number` = '5555', `users`.`updated_at` = '2021-08-02 01:39:31.058726' WHERE `users`.`id` = 2

  def password
    @user = current_user
    if params.has_key?(:edit_password)
      if params[:edit_password][:password] == params[:edit_password][:password_confirmation]
        @user.update_attribute(:password, params[:edit_password][:password])
---
UPDATE `users` SET `users`.`password_digest` = '$2a$12$SDH.3qoYiJTstFKuTsPvhe3hZ6xAEePEvf1RLGAEXjSwtCXpViele', `users`.`updated_at` = '2021-08-02 12:23:59.249681' WHERE `users`.`id` = 3

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`username`, `password_digest`, `phone_number`, `created_at`, `updated_at`) VALUES ('abdul', '$2a$12$13sCkbuhvt49xWSWv6CZQ.joSzp9cXA10v0SQCBrrACZddnzmRKZy', '123', '2021-08-01 20:07:50.910045', '2021-08-01 20:07:50.910045')